Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: །ཟླ་བའི་འོད་དང་ཉི་མའི་འོད་ཀུན་དག །རྒྱལ་བའི་སྤྱན་སྔ་ན་ནི་ལྷ་མེར་མིན།
en: All the light of the moon and the sun Is outshined in the presence of the Victor.

source: །སངས་རྒྱས་ཞིང་འདི་ཐམས་ཅད་གསལ་མཛད་པ། །ཇི་ལྟར་དབང་ཕྱུག་དབང་སྒྱུར་ཇི་བཞིན་ནོ།
en: You illuminate this entire buddha field, Just like a powerful master. “

source: །འདི་ན་སེམས་ཅན་ཁ་ཅིག་ནད་ཀྱིས་ཐེབས། །གང་དག་ནད་པ་ཉམ་ཆུང་མཐུ་ཆུང་བ། །སེམས་ཅན་མང་པོ་དེ་རིང་ནད་མེད་གྱུར།
en: Some beings here are struck by disease, And those infirm beings have lost their strength and power, Yet today many of them have been cured of disease.

source: །སུ་ཡི་མཐུ་ལགས་འདིར་ནི་ལུང་བསྟན་གསོལ།
en: Please explain whose power that is. “

source: །དེར་འཛུམ་མཛད་པ་ཇི་འདྲར་གདའ་བ་དག །དེ་འདྲ་ནམ་ཡང་མ་མཐོང་མ་ཐོས་པས།
en: The manner in which you smiled Is a way that we have never seen or heard of before.

source: །དེང་ནི་ཐམས་ཅད་ཐེ་ཚོམ་གྱུར་ལགས་ན། །སྐྱེས་འདུལ་ཁ་ལོ་སྒྱུར་བ་དེ་ལུང་སྟོན།
en: Since all of us here harbor doubts about this, Leader who trains beings, please teach about this. “

source: །བདག་ནི་ཁྱོད་ཀྱི་འདྲིའོ་རིམ་གྲོ་འཚལ། །འཛུམ་པ་མཛད་པའི་རྒྱུ་རྐྱེན་གང་ཅི་ལགས།
en: I respectfully ask this of you: What are the cause and reason for this smile?

source: །གང་དག་ཐོས་ནས་ཡི་རངས་འགྱུར་བ་ཡི།
en: Whoever hears this will be filled with joy.

source: །མགོན་པོ་དེ་རིང་བདག་ལ་དེ་ལུང་སྟོན།
en: Hence, Protector, please explain this to me. “

source: །དེང་སུའི་དོན་ཆེན་རྒྱ་ཆེན་འགྱུར་བ་དང་།
en: Who will be benefited in a vast way today?

source: །ཆོས་ཀྱི་མཛོད་འདི་སུ་ཞིག་འཛིན་པ་དང་།
en: Who will uphold this Dharma treasure?

source: །དེང་བདུད་དཔུང་བཅས་བཞོན་དང་བཅས་པ་དག །སུ་འཇོམས་དེ་ནི་བདག་ལ་ལུང་བསྟན་གསོལ།
en: Who will conquer Māra today, Along with his soldiers and cavalry? “

source: །ཆོས་རྣམས་ཐམས་ཅད་མཐར་ནི་ཕྱིན་པ་པོ།
en: You have perfected all qualities.

source: །ཐུབ་པ་ཁྱོད་འདྲ་མ་མཆིས་གོང་ན་ག་ལ་མཆིས།
en: Sage, you are unique—how could there be anyone greater?

source: །མི་མཆོག་ཆོས་དབྱིངས་ཁྱོད་ལ་ཞུ་ལགས་ན། །དོན་དམ་མཁས་པས་དེ་ནི་ལུང་བསྟན་གསོལ།
en: Supreme being in the realm of phenomena, I request you— You who know the ultimate, please explain this.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་པད་མ་དཔལ་གྱི་སྙིང་པོས་བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་སུམ་ཁྲི་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡང་དག་པར་ཞུགས་སོ།
en: The Blessed One then said to venerable Ānanda, “When youthful Heart of the Glorious Lotus gave this teaching, thirty thousand creatures set out for awakening.

source: །ཀུན་དགའ་བོ་དེང་བསྟན་པ་འདིའི་དབང་དུ་བྱས་ནས་ངའི་ཐད་ནས་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཞུགས་པ་དག་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: With respect to today’s teaching, Ānanda, do you see those here before me who have set out for awakening?

source: ཁྱིམ་བདག་འདི་རྣམས་ནི་འདི་ནས་ཤི་འཕོས་མ་ཐག་ཏུ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: As soon as these householders pass away, they will be born among the gods of the Heaven of the Thirty-Three.

source: །དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་ཕྱི་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་དེ་དག་འཛམ་བུའི་གླིང་དུ་མི་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་འགྱུར་རོ།
en: When they pass away from there, they will then be born into the class of humans of Jambudvīpa during the final five-hundred-year period.

source: །དེ་དག་འཛམ་བུའི་གླིང་དུ་སྐྱེས་པའི་མོད་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་ཉན་པར་འགྱུར་རོ།
en: As soon as they are born into Jambudvīpa, they will hear this Dharma teaching.”

source: །དེ་ནས་སྲོག་ཆགས་སུམ་ཁྲི་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་གིས་ཀྱང་སླད་མའི་ཚེ་སླད་མའི་དུས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པར་བགྱིའོ།
en: Then those thirty thousand beings addressed the Blessed One, “Later on, in the future, we will explain this Dharma teaching.”

source: །དེའི་ཚེ་དེའི་དུས་ན་འཁོར་དེ་ཉིད་ན་དགེ་སློང་ལྔ་བརྒྱ་ཙམ་ཞིག་འདུས་ཤིང་འདུག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: At that time, five hundred monks who were present in the assembly rose from their seats and addressed the Blessed One, “Blessed One, please bless this Dharma teaching.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཀྱང་སླད་མའི་ཚེ་སླད་མའི་དུས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱས་པར་བགྱིའོ།
en: Blessed One, later on, in the future, we will also cause this Dharma teaching to flourish.”

source: །དེའི་ཚེ་དེའི་དུས་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་འདུས་ཤིང་འདུག་པར་གྱུར་ཏེ། དེ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: At that moment, Śakra, king of the gods, Brahmā, lord of the Sahā universe, and the Four Great Kings—all of whom were present in the assembly—addressed the Blessed One, saying, “Blessed One, please bless this Dharma teaching.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ནི་ཆོས་སྨྲ་བ་དེ་དག་བསྲུང་ཞིང་བསྐྱབ་པར་བགྱིའོ།
en: Blessed One, we will guard and protect those Dharma teachers.

source: །བརྩོན་པར་བགྱིའོ། །ཀུན་ཏུ་བསྲུང་བར་བགྱིའོ།
en: We will exert ourselves and protect them.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་སྐུ་ལས་འོད་ཕྱུང་སྟེ། འོད་རེ་རེ་ལས་ཀྱང་སྤྲུལ་པ་དག་སྤྲུལ་ཏོ།
en: Then rays of light streamed from the body of the Blessed One, and out of each light ray emanations appeared.

source: །སྤྲུལ་པ་རེ་རེ་པོས་ཀྱང་དགེ་སློང་དེ་དག་ལ་མེ་ཏོག་དང་། སྤོས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གཏོར་ཏོ། །མངོན་པར་གཏོར་ཏོ། །
en: Every emanation then scattered and tossed flowers and incense to the monks.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་འདི་ལྟ་བུ་མངོན་པར་འདུ་མཛད་དེ། ཁྱིམ་བདག་གི་བུ་བཟང་སྐྱོང་དང་། དེད་དཔོན་བཟང་པོ་དང་། ཕུག་སྦས་དང་། སྡོང་བུས་བྱིན་དང་། ཆུ་ལྷ་དང་། དབང་པོས་བྱིན་དང་། རིགས་ཀྱི་བུ་མིས་བྱིན་དང་། སྐྱེས་བུ་དམ་པ་བརྒྱད་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཤར་ཕྱོགས་ལོགས་ན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་མཉམ་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་དག་མངོན་པར་འདུ་མཛད་དོ།
en: The Blessed One proceeded to manifest a miracle whereby the householder sons Bhadrapāla, Susārthavāha, Guhyagupta, Given by Lamp Wick, Varuṇa, Indradatta, the noble son Naradatta, and the eight holy men all looked to the east and saw as many blessed buddhas as there are grains of sand in the Ganges river. Such was the miracle he manifested.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེན་པོ་འདི་བསྟན་ཅིང་བཤད་པ་ན། ཁྱིམ་བདག་བརྒྱད་པོ་དེ་དག་གིས་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོས་ནས་རབ་ཏུ་སྒྲོགས་པར་འགྱུར་རོ།
en: The Blessed One then spoke to venerable Ānanda, “Ānanda, when this vast Dharma teaching given by the Thus-Gone One was taught and explained, those eight householders attained the absorption called complete illumination, and they will proclaim it.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་ཁྱོད་ཀྱིས་འདི་དག་ན། །དགེ་སློང་བརྒྱད་པོ་ངའི་མདུན་ན། །ཡེ་ཤེས་ཆེན་པོ་བྱིན་བརླབ་གསོལ། །ཐུབ་པ་ཆེན་པོ་བྱིན་བརླབ་གསོལ།
en: Then the Blessed One spoke these verses: “Ānanda, did you see These eight monks who came before me Requesting blessings for great wisdom And blessings for great abilities? “

source: །མགོན་པོ་བདག་ཅག་སླད་དུས་ཚེ། །འདི་འདྲའི་ཆོས་དག་བཤད་བགྱི་ཞེས།
en: They said, ‘Great Protector, in the future, We will give teachings like this one.

source: །ཐལ་མོ་སྦྱར་ནས་ཆོས་ཀྱི་ཕྱིར། །གསོལ་བ་འདེབས་པ་མཐོང་གྱུར་ཏམ།
en: With palms joined together, they beseeched me For the sake of the Dharma. “

source: །གང་དང་ཐབས་ཅིག་བགྲོ་མཛད་ཅིང་། །གང་ན་སངས་རྒྱས་གང་སྒྲོགས་རྣམས། །གང་དག་མདོ་འདི་འཛིན་བྱེད་པ། །དེ་ལ་ཐམས་ཅད་སྲུང་བར་མཛད།
en: When this discourse is discussed, When there is a buddha who professes it, When there is someone who upholds it, Then all of that will be protected. “

source: །གང་དག་བལྟ་དཀའ་ཆོས་སྤྱོད་པས། །སངས་རྒྱས་དེ་དག་དང་མི་འབྲལ།
en: Those who practice the Dharma that is hard to find Will not be separate from the Buddha.

source: །གང་ཞིག་འདི་ནི་ལུང་ནོད་པ། །དེ་བཞིན་ཉིད་ལ་གནས་པར་འགྱུར།
en: Those who receive this instruction Will rest in suchness. “

source: །ང་ཡིས་བགྲོ་བ་བཤད་པ་འདི། །གང་དག་ལུང་ནོད་འགྱུར་བ་རྣམས། །དེ་དག་གི་ནི་མདུན་ན་ཡང་། །སངས་རྒྱས་བཞུགས་ཤིང་ཞལ་ཡང་སྟོན།
en: Those who receive instruction In this discussion I have taught Will see the Buddha in front of them, Revealing his face to them. “

source: །སངས་རྒྱས་བགྲོ་བ་གསུངས་འདི་ནི། །གང་དག་ལུང་ནོད་འགྱུར་བ་ཡི། །དགེ་སློང་དེ་དང་དེ་དག་རྣམས། །ང་ཡི་ཆོས་སྲུང་སྐྱོང་བར་འགྱུར།
en: Those monks Who receive instruction In this discussion about the buddhas that I have taught Are safeguarding my teachings. “

source: །ང་ཡིས་བགྲོ་བ་བཤད་པ་འདི། །གང་དག་ལུང་ནོད་འགྱུར་བ་རྣམས། །དེ་དག་གིས་ནི་བྱང་ཆུབ་བཟུང་། །སངས་རྒྱས་རྣམས་ཀྱི་མཐའ་ཡས་མཛད།
en: Those who receive instruction In this discussion I have taught Have grasped awakening; They perform the limitless nature of the buddhas. “

source: །སངས་རྒྱས་བགྲོ་བ་དམ་པ་འདི། །གང་དག་ལུང་ནོད་འགྱུར་བ་རྣམས། །སངས་རྒྱས་ཡེ་ཤེས་བླ་མེད་ལ། །དེ་དག་ཐམས་ཅད་ངེས་པར་གནས།
en: Those who receive instruction In this sacred discussion about buddhas Are all certain to abide In the peerless wisdom of the buddhas. “

source: །སངས་རྒྱས་བགྲོ་བ་དམ་པ་འདི། །གང་དག་ལུང་ནོད་འགྱུར་བ་རྣམས། །དེ་དག་གིས་ནི་བདུད་བཏུལ་ཅིང་། །བྱང་ཆུབ་སྙིང་པོར་གནས་པ་ཡིན།
en: Those who receive instruction In this sacred discussion about buddhas Have tamed Māra And abide at the seat of awakening. “

source: །སངས་རྒྱས་བགྲོ་བ་དེ་བཞིན་ཉིད། །འདི་ནི་གང་དག་ལུང་ནོད་པ། །དེ་དག་གིས་ནི་བདུད་བཏུལ་ཅིང་། །བྱང་ཆུབ་སྙིང་པོར་གནས་པ་ཡིན།
en: Those who receive instruction In the suchness of this discussion about buddhas Have tamed Māra And abide at the seat of awakening. “

source: །བསྟན་པ་དེ་ཡང་གཟུངས་དེ་ཡིན། །ཏིང་ངེ་འཛིན་ཀྱང་བསྟན་པ་ཡིན།
en: That teaching is also a dhāraṇī; That absorption is also this teaching.

source: །སེམས་ཅན་དེ་དག་འདི་དག་བསྟན། །སངས་རྒྱས་བདེན་པ་གཞན་མི་འགྱུར།
en: Those beings will teach this; The Buddha’s truths will not be altered. “

source: །གང་གིས་བྱང་ཆུབ་དག་གི་ཕྱིར། །སངས་རྒྱས་འདི་དག་ཀུན་འདོད་པ། །དེས་ནི་ང་ཡིས་བཤད་པ་ཡི། །བགྲོ་བ་འདི་ནི་ལུང་མནོད་བྱ།
en: Whoever longs for all these buddhas For the sake of pure awakening Should receive instruction In these discussions that I have taught. “

source: །མི་གང་འདས་པའི་རྫོགས་སངས་རྒྱས། །དེ་དག་ལྟ་བར་འདོད་པས་ནི། །ཆོས་ཉིད་ཡེ་ཤེས་ཆེན་པོ་ཡི། །བགྲོ་བ་མྱུར་དུ་ལུང་མནོད་བྱ།
en: Those who wish to see The perfect buddhas of the past Must quickly receive instruction on this discussion Of great wisdom—reality itself. “

source: །ཁ་ཅིག་མདོ་འདི་ཚུལ་ལ་ནི། །སྤྲོ་བར་བྱེད་པ་དེ་དག་ལ། །ཕྱི་དུས་ཚེ་ན་ང་ཡིས་ནི། །འདི་འདྲ་བ་ཡི་ཆོས་བཤད་བྱ།
en: Some find joy In the manner of this discourse; In the future, I will give Similar instructions to them. “

source: །ང་ཡི་ཆོས་ནི་འདི་འདྲ་དག །ཐོས་ནས་བཟུང་སྟེ་མང་དུ་ཐོས། །དེ་དག་གིས་ནི་ཏིང་ངེ་འཛིན། །སྣང་བྱེད་ཅེས་བྱ་དེ་རིང་ཐོབ།
en: Those who are learned due to hearing and retaining My teachings such as this Have today obtained the absorption Known as illumination. “

source: །ཕྱི་མའི་དུས་ན་དེ་དག་གིས། །ཏིང་ངེ་འཛིན་ལ་གནས་ནས་ནི། །སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །ང་ཡི་ཆོས་ནི་འཛིན་པར་འགྱུར།
en: By abiding in that absorption, In the future these beings Will uphold my teaching For the benefit of all creatures. “

source: །དེ་ཚེ་གང་དག་ཁ་ཅིག་གིས། །མདོ་འདི་འཛིན་འགྱུར་ང་ཡིས་ནི། །དེ་བཞིན་གཤེགས་པ་མ་མཐོང་ཞེས། །ཐེ་ཙོམ་དག་ནི་བསྐྱེད་མི་བྱ།
en: At that time, some individuals Will say, ‘I have received this discourse, But I have not met the Thus-Gone One,’ Yet they must not develop such doubts. “

source: །ཕྱི་དུས་ངན་འགྲོ་ཆེན་པོ་སྟེ། །དེ་ཚེ་གང་དག་མི་རྣམས་ཀྱིས། །ཏིང་འཛིན་མིང་ནི་ཉན་བྱེད་པ། །ཐམས་ཅད་ང་ཡི་མདུན་ན་འཁོད།
en: In a future time, When lower rebirths are numerous, All humans who hear the name of this absorption Will be seated before me. “

source: །མདོ་འདི་དག་ནི་བསྒྲགས་པ་ཡིས། །ང་ཡི་སྲས་ནི་འདིར་ཡོད་རྣམས། །ཕྱི་དུས་དམ་ཆོས་འཇིག་པའི་ཚེ། །དེ་དག་ཆོས་ནི་སྐྱོང་བར་འགྱུར། །
en: My heirs who are present here, Who proclaim these discourses, Will protect the Dharma in the future, When the holy Dharma is being destroyed. “

source: གང་དག་ཁ་ཅིག་མདོ་འདི་ནི། །ཐོབ་པར་བྱ་ཕྱིར་དེ་ཚེ་བརྩོན། །ཀུན་དགའ་དེ་དག་ཐམས་ཅད་ནི། །སངས་རྒྱས་སྤྱན་གྱིས་ངས་མཐོང་ངོ་།
en: Those who exert themselves In order to obtain this discourse— I can see them all, Ānanda, With my buddha eye. “

source: །ཀུན་དགའ་དེ་ཕྱིར་ཁྱོད་ལ་ནི། །བྱང་ཆུབ་མཆོག་མ་གཏད་བྱ་སྟེ།
en: Therefore, Ānanda, I entrust you with supreme awakening.

source: །སྲོག་ཆགས་རྣམས་ལ་བཤད་པ་ལྟར། །ཁྱོད་ལ་འདི་ནི་གཞག་པར་བྱ།
en: I pass this on to you So that you will instruct beings. “

source: །ཁ་ཅིག་མདོ་འདི་བསྲུང་བའི་ཕྱིར། །དེ་ཚེ་བརྩོན་པར་བྱེད་པ་དག །དེ་དག་གིས་ནི་ང་བསྲུངས་པས། །སངས་རྒྱས་བསྲུངས་པའང་མཐའ་ཡས་སོ།
en: Some individuals will endeavor To protect this discourse; By protecting me, They will be protecting infinite buddhas. “

source: །དེ་ལྟར་ཆོས་བསྲུངས་བྱས་པས་ནི། །མི་དེ་དག་ནི་བསྲུང་བར་འགྱུར།
en: By protecting the Dharma in that way, Those people are also protected.

source: །མདོ་འདི་ཕྱོགས་བཞིར་དེ་དག་གིས། །བཙལ་ཀྱང་རྙེད་པར་མ་གྱུར་ལ། །ངས་བསྟན་པ་ཡི་སངས་རྒྱས་གང་།
en: Though they search for this discourse In the four directions, people do not find it. “

source: །ཕྱོགས་བཅུ་དག་ན་གང་རྣམས་དག །དེ་ལྟར་སངས་རྒྱས་དེ་དག་ལ། །སྦྱིན་པ་བསམ་མི་ཁྱབ་པ་ཕུལ།
en: They must make an inconceivable offering To the buddhas I have pointed out— To all those buddhas In the ten directions. “

source: །རྣམ་སྨིན་དེ་དག་ཇི་སྙེད་པ། །ངས་བཤད་པ་ནི་མཉན་པར་གྱིས།
en: Through the ripening of those acts, They will come to hear what I have said.

source: །མདོ་འདི་རྙེད་པར་མ་གྱུར་པ། །རྙེད་པར་གྱུར་ན་སྨོས་ཅི་དགོས།
en: If that is the case for those who have not found this discourse, What need is there to speak of those who have already found it? “

source: །སངས་རྒྱས་ཞིང་འདི་ཐམས་ཅད་དག །མ་ལུས་པར་ནི་མི་ཞིག་གིས། །ཇི་ལྟར་བྱེ་མས་བྱུར་བུར་ནི། །རབ་ཏུ་བཀང་བར་གྱུར་པ་དག །
en: Imagine that a person filled All buddha fields Without exception With piles of sand. “

source: སྐྱེས་བུ་ལ་ལས་དེ་དག་ཀུན། །ཤར་ཕྱོགས་ལོགས་སུ་དེ་དག་འདོར། །བྱེ་མའི་རྡུལ་ནི་རེ་རེ་ནས། །ལག་པ་གཅིག་གིས་བླངས་ནས་ཀྱང་།
en: This person then scattered it all In the eastern direction By picking up each grain of sand With one hand. “

source: །འཇིག་རྟེན་ཁམས་དག་མཐའ་ཡས་པའི། །འཇིག་རྟེན་ཁམས་ནི་དེ་དག་ཏུ། །བྱེ་མའི་རྡུལ་ནི་ཇི་སྙེད་ཉིད།
en: And they then took all those grains— As many as there are In all the infinite world systems— And put them all down again. “

source: །མ་ལུས་པར་ནི་འཇོག་བྱེད་པ། །དེ་བཞིན་དུ་ནི་སྦྱར་བྱས་པ། །མཁས་པ་གང་གིས་མི་ཤེས་ན། །བྱེ་མ་དག་གི་རྡུལ་གྱུར་པ། །འཇིག་རྟེན་ཁམས་སུ་བགྲང་བྱ་སྟེ།
en: When all had been placed like that, No wise being would be able to know How to count the number Of such grains of sand in the world. “

source: །དེ་བཞིན་ལྷོ་ཕྱོགས་དག་ཏུ་ཡང་། །མི་དག་གིས་ནི་འདོར་བར་བྱེད། །བྱེ་མའི་ཕུང་པོ་ཇི་སྙེད་དེ། །གང་དག་ང་ཡིས་སྔར་བསྟན་པ།
en: If to the south as well Someone scattered sand in the same way, There would be as many heaps of sand As I have already described. “

source: །དེ་བཞིན་ཕྱོགས་བཞི་དག་ཏུ་ཡང་། །མི་ཡིས་བྱེ་མ་འདོར་བར་བྱེད། །སྔར་ནི་ཇི་སྙེད་བསྟན་པ་ཡི། །དེ་སྙེད་བྱེ་མར་གྱུར་པ་དང་།
en: Likewise, sand that a person scattered In each of the four directions Would result in as much sand As I described before. “

source: །ཇི་སྙེད་བསྟན་པའི་བྱེ་མ་སྙེད། །དེ་སྙེད་འཇིག་རྟེན་ཁམས་དེ་དག །འདིར་ནི་དེ་དག་ཐམས་ཅད་ཀྱང་། །གྲོང་ཁྱེར་གྲུ་བཞི་གཅིག་གྱུར་ལ།
en: Then, imagine that a number of worlds, Equal to the number of grains of sand just described, Are all gathered together Into a single square city. “

source: །སྐྱེས་བུ་ལ་ལ་བྱུང་བས་ནི། །གྲོང་ཁྱེར་བརྩིགས་པ་དེ་དག་ཏུ། །རིན་པོ་ཆེ་ཡིས་བཀང་བྱས་ཏེ། །སྐྱོབ་པ་སངས་རྒྱས་རྣམས་ལ་ཕུལ།
en: Then imagine that a man appears And fills up this constructed city With all the most precious things And offers it all to the protectors—the buddhas. “

source: །སྦྱིན་དེ་དེ་དག་ལ་ཕུལ་བས། །འཇིག་རྟེན་མགོན་པོ་བསམ་མི་ཁྱབ། །རྐང་གཉིས་གཙོ་བོར་གྱུར་ཅིག་ཅེས། །བྱང་ཆུབ་མཆོག་ཏུ་སྨོན་པར་བྱེད།
en: Having made that offering, He aspires to supreme awakening, saying, ‘May I become an inconceivable guardian of the world— The foremost among humans.’ “

source: །དེ་ནི་བྱང་ཆུབ་ཉིད་ཚོལ་ལ། །མདོ་འདི་དག་ནི་མི་ཚོལ་ཏེ། །ངས་བཤད་པ་ཡི་བགྲོ་བ་དག །མདོ་འདི་དག་ནི་རྙེད་མི་འགྱུར།
en: Even such a person who seeks awakening Yet does not search for these discourses Will not find these discourses On the discussions that I have explained. “

source: །གང་ཞིག་མདོ་འདི་ཚོལ་བྱེད་པ། །དེ་སྙེད་བསོད་ནམས་འཕེལ་བར་འགྱུར། །མང་དུ་ཐོས་པ་ཀུན་དགའ་བོ།
en: In comparison to that person, those who seek this discourse Will gain a greater increase in merit. O learned Ānanda, They will gain a superior awakening. “

source: །འདི་ལས་བྱང་ཆུབ་ལྷག་པར་ནི། །བགྲོ་མཛད་དེ་བཞིན་དགེ་སློང་དང་། །དགེ་སློང་མ་དག་ངས་ལུང་བསྟན།
en: I prophesy such awakening for the monks and nuns Who follow these discussions.

source: །ངས་བཤད་པ་ཡི་བགྲོ་བ་འདི། །གང་དག་ཚོལ་བྱེད་དེ་དག་གིས།
en: It will come to those who seek these discussions That I have now explained. “

source: །ང་སྔོན་བྲམ་ཟེ་ཁྱེའུ་དེའི་ཚེ། །གང་གིས་བྱང་ཆུབ་ཕྱིར་ལུང་བསྟན།
en: In the past, I was a young brahmin Who taught for the sake of awakening.

source: །དེ་ཚེ་ཐོག་མར་བྱང་ཆུབ་ཕྱིར། །གང་ལ་བསོད་ནམས་ངས་བསྐྲུན་པ།
en: At that time, for the sake of awakening, I would always produce merit. “

source: །མར་མེ་ཞེས་བྱ་བསམ་མི་ཁྱབ། །ཡེ་ཤེས་ལྡན་ཆེན་མཐོང་བ་ཡིན།
en: I was known as Lamp, and I had a vision Of inconceivably great wisdom.

source: །གང་དག་འདི་ལུང་ནོད་དེ་དག །རྫོགས་པའི་སངས་རྒྱས་དེ་མཐོང་ངོ་།
en: Whoever received this instruction Would meet the perfect buddhas. “

source: །རྟག་པར་སེམས་ཅན་ཀུན་བདེ་ཕྱིར། །གྲངས་མེད་བདུན་བརྒྱ་རྫོགས་པ་སྟེ། །གཅིག་ཀྱང་མ་ཚང་མེད་པར་ནི། །བྱང་ཆུབ་ཆེད་དུ་ངས་བཙལ་ལོ།
en: Continuously, for the happiness of all beings, I strove for awakening For seven hundred incalculable eons, So that there would not be a single person lacking. “

source: །མང་ཐོས་ང་དང་ལྷན་ཅིག་ཏུ། །དེ་དག་གིས་ཀྱང་བསོད་ནམས་བསྐྱེད།
en: I generated merit Together with learned ones.

source: །གང་དག་འདི་ནི་ལུང་ནོད་ཅིང་། །བྱང་ཆུབ་མཆོག་མར་སྨོན་བྱེད་པ། །དེ་དག་བྱང་ཆུབ་མི་ཉམས་ཤིང་། །དེ་དག་བྱང་ཆུབ་དཀོན་པ་མེད།
en: Whoever receives instruction on this And aspires to supreme awakening “Will have faultless awakening, And awakening will not be difficult for them.

source: །གང་དག་ངས་བཤད་པ་ཡི་མདོ། །འདི་ནི་གང་དག་ལུང་ནོད་པ། །དེ་དག་སངས་རྒྱས་བྱང་ཆུབ་རྒྱུ། །ང་ཡིན་ཏེ་ནི་ཐེ་ཚོམ་མེད།
en: Whoever receives instruction On this discourse that I have explained “Will not have any doubts That I am the cause for the awakening of buddhas.

source: །གང་དག་ཕྱི་མའི་དུས་དེ་ཚེ། །མི་རྣམས་ཀྱིས་ནི་ཚུལ་འདི་མཐོང་།
en: Yet in future times, People will not see the proper way. “

source: །ཕྱི་མའི་དུས་ན་དགེ་སློང་དག །སངས་རྒྱས་བྱ་བ་བྱེད་པར་འགྱུར།
en: At that point in the future, The monks will perform buddha activity.

source: །ངས་བསྟན་པ་ཡི་བགྲོ་བ་དག །འདི་ནི་གང་དག་འཛིན་འགྱུར་བ།
en: They will remember These discussions I have taught. “

source: །ཀུན་དགའི་དེ་ཕྱིར་དེ་ལ་ནི། །འདི་འདྲའི་མདོ་དག་ངས་གཏད་བྱ།
en: Ānanda, it is for that reason That I confer discourses such as this.

source: །སངས་རྒྱས་ཀྱིས་བཤད་བགྲོ་བ་དག །ཡུལ་ཕྱོགས་གང་དུ་འདི་གསུང་བ། །ས་ཡི་ཕྱོགས་ནི་དེ་དག་ཏུ། །དེ་ཚེ་གནོད་སྦྱིན་མདངས་འཕྲོགས་པས། །སེམས་ཅན་རྣམས་ཀྱི་མདངས་མི་འཕྲོག །
en: Anywhere these discussions Had by the buddhas are proclaimed, “In those places, The yakṣas who rob vitality Will no longer rob the vitality of beings.

source: མང་ཐོས་དེ་ལྟར་ཤེས་པར་གྱིས།
en: Learned ones should know it to be like that. “

source: །གང་དག་དུག་དང་བཅས་པའི་ལུས། །ཡུལ་ཕྱོགས་སུ་ནི་བསྐུར་བྱ་སྟེ།
en: Those with bodies infected with poison Should venerate this discourse throughout the land.

source: །དེ་ན་དེ་དག་དུག་མེད་པར། །འགྱུར་བ་ལ་ནི་ཐེ་ཚོམ་མེད།
en: There is no doubt That they will then become free of poison. “

source: །སངས་རྒྱས་ཀྱིས་བཤད་བགྲོ་བ་དག །མདོ་འདི་གང་དུ་གསུངས་པ་ཡི། །ས་ཕྱོགས་དེ་ནི་ཀུན་དགའ་བོ། །མཆོད་རྟེན་གྱུར་པར་ཤེས་པར་གྱིས།
en: Ānanda, you should know that any land Where this discourse on the discussions Had by the buddhas is expounded Becomes a place of worship. “

source: །སྔོན་གྱི་མགོན་པོ་འདས་པ་སྟེ། །འཇིག་རྟེན་སྣང་བྱེད་གང་དག་གིས། །ས་ཡི་ཕྱོགས་ནི་འདི་ཉིད་དུ། །མདོ་འདི་དག་ནི་རབ་ཏུ་བཤད།
en: Previous protectors of the past, Those who illuminated the world, Fully explained these discourses In this very place. “

source: །སེམས་ཅན་མྱ་ངན་འཇིགས་བྱེད་པ། །ད་ལྟར་རྫོགས་སངས་རྒྱས་ངས་ཀྱང་། །ས་ཡི་ཕྱོགས་ནི་འདི་ཉིད་དུ། །མདོ་མཆོག་དག་ནི་བཤད་པར་བྱ།
en: I, the perfect buddha of the present, Who destroys the sorrow of beings, Also teach these supreme discourses In this very place. “

source: །འཇིག་རྟེན་མགོན་པོ་བསམ་མི་ཁྱབ། །རྫོགས་པའི་སངས་རྒྱས་བྱམས་པས་ཀྱང་། །ས་ཡི་ཕྱོགས་ནི་འདི་ཉིད་དུ། །མདོ་སྡེ་འདི་ནི་འཆད་པར་འགྱུར།
en: The inconceivable protector of the world, The perfect Buddha Maitreya, Will also teach this discourse In this very place. “

source: །མང་ཐོས་བྱམས་པ་འདི་ཡིས་ནི། །མདོ་འདི་སྟོན་པར་བྱེད་པ་ན། །ཐེར་འབུམ་བརྒྱད་ཅུ་ཚང་བ་དག །བྱང་ཆུབ་ཏུ་ཡང་ལུང་སྟོན་འགྱུར།
en: When the learned Maitreya Teaches this discourse, Eighty billion beings in all Will be prophesied to reach awakening. “

source: །བདག་ནི་གང་གིས་ཡོངས་སྨིན་བྱས། །ཀྱེ་མའོ་སངས་རྒྱས་ཤཱཀ་ཐུབ་ཅེས། །སྐད་ཅིག་དེ་ལ་ང་ཡི་མིང་། །རྫོགས་སངས་རྒྱས་ཀྱིས་བརྗོད་པར་འགྱུར།
en: As one who has matured my own being, My name, at that moment, Will be uttered by the perfect Buddha: ‘O Buddha Śākyamuni.’ “

source: །བྱམས་པ་ཡི་ནི་ཐང་དག་ནས། །སྲོག་ཆགས་བྱེ་བ་གྲངས་མེད་པས། །ང་ཡི་མིང་ནི་ཐོས་ནས་ཀྱང་། །བྱང་ཆུབ་མཆོག་ཏུ་སྨོན་པར་བྱེད།
en: Incalculable millions of creatures, Sitting before Maitreya, Will then hear my name And make aspirations for supreme awakening. “

source: །སྐད་ཅིག་དེ་ལ་སངས་རྒྱས་ལ། །དེ་བཞིན་གཤེགས་པ་བྱམས་པ་ཡང་། །འཛུམ་པ་དག་ནི་མཛད་འགྱུར་ཞིང་། །དེ་ནི་ཆོ་འཕྲུལ་བསམ་མི་ཁྱབ།
en: At that moment the Buddha— The thus-gone Maitreya— Will smile and so produce An inconceivable magical display. “

source: །ཕྱི་མའི་དུས་ན་གང་ཁ་ཅིག །ཚུལ་འདི་དག་ནི་ཚོལ་བྱེད་པ། །ཀུན་དགའ་དེ་ནི་དེ་ཡི་ཚེ། །བྱམས་དང་ཕྲད་པར་ལུང་བསྟན་བྱ།
en: Those in the future Who seek out these methods— Ānanda, those people Should be prophesied to encounter Maitreya.”

source: །ཤཱཀྱ་སེང་གེ་དེ་ཡིས་ནི། །མདོ་འདི་བཤད་པ་དེ་མོད་ལ། །སྲོག་ཆགས་སྟོང་ཕྲག་བརྒྱད་ཅུ་གང་། །བྱང་ཆུབ་ལ་ནི་མངོན་པར་ཞུགས།
en: When the Lion of the Śākyas Explained this discourse, Eighty thousand creatures Directly entered awakening.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དགེ་སློང་ཆོས་བཞི་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་སྤོང་བར་བྱེད་དེ།
en: The Blessed One then said to venerable Ānanda, “Ānanda, if a monk has these four qualities, he will reject the awakening of a buddha.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: ཀུན་དགའ་བོ་འདི་ལ་དགེ་སློང་ལྷག་པའི་ང་རྒྱལ་ཅན་ཡིན་ཏེ།
en: (1) Ānanda, that monk will have excessive pride.

source: ལྷག་པའི་ང་རྒྱལ་ཅན་དེས་ལྷག་པའི་ང་རྒྱལ་མེད་པའི་ཆོས་ཐོས་ན་སྐྲག་ཅིང་དངང་ལ་རབ་ཏུ་དངང་བར་འགྱུར་རོ།
en: If that monk with excessive pride hears a teaching on the absence of excessive pride, he will be scared, fearful, and frightened.

source: །གཡང་ས་ཆེན་པོར་ཡང་ལྟུང་བར་འགྱུར་རོ།
en: He will fall into a great abyss.

source: །དེས་གཏིང་དཔག་མེད་པ་ཡང་སྤོང་བར་བྱེད་ཅིང་མི་འཐུན་པར་སྨྲ་ལ་ཀུན་ནས་ཁྲོ་བར་བྱེད་དོ།
en: He will fall to bottomless depths. He will become consumed with anger at such unwelcome words.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་དགེ་སློང་དེ་ནི་བདག་ཏུ་མངོན་པར་ཞེན་ཅིང་མཚམས་དྲལ་བ་ཡིན་ཏེ་ཀུན་དགའ་བོ་ཆོས་གཉིས་པོ་འདི་དང་ལྡན་པའི་དགེ་སློང་ནི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་སྤོང་བར་བྱེད་ཅིང་མི་འཐུན་པར་སྨྲ་ལ་ཀུན་ནས་ཁྲོ་བར་བྱེད་དོ།
en: (2) Furthermore, Ānanda, that monk will be attached to the self and have no boundaries. Ānanda, a monk who has these two qualities will reject the awakening of a buddha and become consumed with anger at such unwelcome words.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་དགེ་སློང་ཚུལ་ཁྲིམས་འཆལ་པ་ཆོ་ག་ལ་ལོག་པར་ཞུགས་པ་ཡིན་ཏེ་དེ་ཚུལ་ཁྲིམས་འཆལ་པ་དང་ལྡན་པས་ཚུལ་ཁྲིམས་ཀྱི་གཏམ་ཐོས་ན་ཞུམ་པར་འགྱུར་ཏེ་ཀུན་དགའ་བོ་ཆོས་གསུམ་པོ་འདི་དང་ལྡན་པའི་དགེ་སློང་ནི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་སྤོང་བར་བྱེད་ཅིང་མི་འཐུན་པར་སྨྲ་ལ་ཀུན་ནས་ཁྲོ་བར་བྱེད་དོ།
en: (3) Furthermore, Ānanda, a monk with flawed discipline will behave improperly. Because their discipline is flawed, he will become timid when he hears lectures on discipline. Ānanda, a monk who has these three qualities rejects the awakening of a buddha and is consumed with anger at such unwelcome words.
